Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: That is, if a Slice instance is wrapped around a mutable collection that has value semantics, such as an array, mutating the original collection would trigger a copy of that collection, and not affect the base collection stored inside of the slice.
ja: すなわち、Sliceインスタンスが値意味論を持つ可変コレクション、例えば配列などの周りにラップされる場合、オリジナルのコレクションを変化させることはそのコレクションのコピーを誘発します、それでスライス内部に格納される基盤コレクションには影響を及ぼしません。

source: The &<<= operator performs a masking shift, where the value used as rhs is masked to produce a value in the range 0..<lhs.bitWidth.
ja: &<<=演算子は、マスクするシフトを実行します、そこにおいてrhsとして使われる値はマスクされることで範囲0..<lhs.bitWidthの中の値を生成します。

source: The &>>= operator performs a masking shift, where the value passed as rhs is masked to produce a value in the range 0..<lhs.bitWidth.
ja: &>>=演算子は、マスクするシフトを実行します、そこにおいてrhsとして渡される値はマスクされることで範囲0..<lhs.bitWidthの中の値を生成します。

source: The << operator performs a smart shift, which defines a result for a shift of any value.
ja: <<演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The >> operator performs a smart shift, which defines a result for a shift of any value.
ja: >>演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The >>= operator performs a smart shift, which defines a result for a shift of any value.
ja: >>=演算子は、ある賢いシフトを実行します、それは何らかの値のシフトに対する結果を定義します。

source: The ASCIILogger type’s write(_:) method processes its string input by escaping each Unicode scalar, with the exception of "\n" line returns.
ja: ASCIILogger型のもつwrite(_:)メソッドは、それの文字列入力を各ユニコードスカラーをエスケープすることによって処理します、"\n"行復帰を除いては。

source: The AdditionPrecedence group, which is left associative, contains the following infix operators:
ja: AdditionPrecedenceグループは、それは左結合です、以下の接中辞演算子を含みます：

source: The AssignmentPrecedence group, which is right associative, contain the following infix operators:
ja: AssignmentPrecedenceグループは、それは右結合です、以下の接中辞演算子を含みます：

source: The BitwiseShiftPrecedence group, which isn’t associative, contains the following infix operators:
ja: BitwiseShiftPrecedenceグループは、それは結合性はありません、以下の接中辞演算子を含みます：

source: The CanonicalCombiningClass type conforms to RawRepresentable with a raw value of type UInt8.
ja: CanonicalCombiningClass型は、RawRepresentableに型UInt8の生の値で準拠します。

source: The CastingPrecedence group, which is left associative, contains the following infix operators:
ja: CastingPrecedenceグループは、それは左結合です、以下の接中辞演算子を含みます：

source: The CoffeeData class implements ObservableObject and has an @Published property to feed the SwiftUI views.
ja: CoffeeDataクラスは、ObservableObjectを実装して、そしてSwiftUIビューに供給する@Publishedプロパティを持ちます。

source: The ComparisonPrecedence group, which isn’t associative, contains the following infix operators:
ja: ComparisonPrecedenceグループは、それは結合性はありません、以下の接中辞演算子を含みます：

source: The Date type can now be used with the stride(from:to:by:) and stride(from:through:by:) functions and as the bounds of an iterable range.
ja: Date型は、今ではstride(from:to:by:)およびstride(from:through:by:)関数でそして反復可能な範囲の境界として使用できます。

source: The HealthKitController type contains several calls to the HealthKit SDK.
ja: HealthKitController型は、HealthKit SDKへのいくつかの呼び出しを含みます。

source: The LogicalConjunctionPrecedence group, which is left associative, contains the following infix operators:
ja: LogicalConjunctionPrecedenceグループは、それは左結合です、以下の接中辞演算子を含みます：

source: The LogicalDisjunctionPrecedence group, which is left associative, contains the following infix operators:
ja: LogicalDisjunctionPrecedenceグループは、それは左結合です、以下の接中辞演算子を含みます：

source: The MultiplicationPrecedence group, which is left associative, contains the following infix operators:
ja: MultiplicationPrecedenceグループは、それは左結合です、以下の接中辞演算子を含みます：

source: The NilCoalescingPrecedence group, which is right associative, contains the following infix operators:
ja: NilCoalescingPrecedenceグループは、それは右結合です、以下の接中辞演算子を含みます：

source: The RangeFormationPrecedence group, which isn’t associative, contains the following infix operators:
ja: RangeFormationPrecedenceグループは、それは結合性はありません、以下の接中辞演算子を含みます：

source: The SIMDStorage protocol defines a storage layout and provides elementwise accesses.
ja: SIMDStorageプロトコルは、ストレージレイアウトを定義します、そして要素単位のアクセスを提供します。

source: The Stride type for Date is Int, inferred from the parameter and return types of advanced(by:) and distance(to:):
ja: DateのためのStride型はIntです、パラメータと戻り値のadvanced(by:)とdistance(to:)から推論されます：

source: The Strideable protocol provides default implementations for the equal-to (==) and less-than (<) operators that depend on the Stride type’s implementations.
ja: Strideableプロトコルは、省略時の実装を同等（==）およびより小さい（<）演算子に対して、Stride型のもつ実装に依存して提供します。

source: The StringInterpolation type is responsible for collecting the segments passed to its appendLiteral(_:) and appendInterpolation methods and assembling them into a whole, converting as necessary.
ja: StringInterpolation型は、それのappendLiteral(_:)とappendInterpolationメソッドに渡される文節を集めること、そしてそれらをある全体へと、必要に応じて変換して、組み立てることに責任があります。

source: The StringLiteralType of an interpolation type must match the StringLiteralType of the conforming type.
ja: 補間型のStringLiteralTypeは、準拠している型のStringLiteralTypeと合致しなければなりません。

source: The TernaryPrecedence group, which is right associative, contains the following infix operators:
ja: TernaryPrecedenceグループは、それは右結合です、以下の接中辞演算子を含みます：

source: The UTF16View in which to find the new position.
ja: それにおいて新しい位置を見つけるUTF16View。

source: The UTF8View in which to find the new position.
ja: それにおいて新しい位置を見つけるUTF8View。

source: The Unicode.Scalar type, representing a single Unicode scalar value, is the element type of a string’s unicodeScalars collection.
ja: 単一のユニコードスカラー値を表している、Unicode.Scalar型は、ある文字列のもつunicodeScalarsコレクションの要素型です。

source: The UnicodeCodec protocol declares methods that decode code unit sequences into Unicode scalar values and encode Unicode scalar values into code unit sequences.
ja: UnicodeCodecプロトコルは、コード単位シーケンスをユニコードスカラー値へデコードする、ユニコードスカラー値をコード単位シーケンスへエンコードするメソッドを宣言します。

source: The UnicodeScalarView in which to find the new position.
ja: それにおいて新しい位置を見つけるUnicodeScalarView。

source: The UnsafeMutableRawPointer type provides no automated memory management, no type safety, and no alignment guarantees.
ja: UnsafeMutableRawPointer型は、自動メモリ管理、型安全、そしてアライメント保証を提供しません。

source: The UnsafeRawPointer type provides no automated memory management, no type safety, and no alignment guarantees.
ja: UnsafeRawPointer型は、自動メモリ管理、型安全、そしてアライメント保証を提供しません。

source: The YES macro from Objective-C is bridged to Swift as an ObjCBool value of true.
ja: Objective-CからのYESマクロは、trueのObjCBool値としてSwiftにブリッジされます。

source: The add function will never (re-)throw errors from the operation.
ja: add関数は、決してエラーをoperationから（再）スローしないでしょう。

source: The adjective constant is created by calling this initializer with a slice of the picnicGuest.unicodeScalars view.
ja: adjective定数は、このイニシャライザをpicnicGuest.unicodeScalarsビューのスライスとともに呼び出すことによって作成されます。

source: The appendInterpolation methods in your custom type must be mutating instance methods that return Void.
ja: あなたのあつらえの型におけるappendInterpolationメソッドは、Voidを返す変更インスタンスメソッドでなければなりません。

source: The async function should be used when creating asynchronous work that operates on behalf of the synchronous function that calls it.
ja: async関数は、非同期作業を作成する時に使われるべきです、それはそれを呼び出す同期関数の代わりに作動するものです。

source: The cafe string is a collection of the nine characters that are visible when the string is displayed.
ja: cafe文字列は、９つの文字からなる１つのコレクションで、その文字列が表示される時に見られます。

source: The endIndex property of an UnsafeBufferPointer instance is always identical to count.
ja: UnsafeBufferPointerインスタンスのendIndexプロパティは、常にcountと同一です。

source: The endIndex property of an UnsafeMutableBufferPointer instance is always identical to count.
ja: UnsafeMutableBufferPointerインスタンスのendIndexプロパティは、常にcountと同一です。

source: The endIndex property of an UnsafeMutableRawBufferPointer instance is always identical to count.
ja: UnsafeMutableRawBufferPointerインスタンスのendIndexプロパティは、常にcountと同一です。

source: The endIndex property of an UnsafeRawBufferPointer instance is always identical to count.
ja: UnsafeRawBufferPointerインスタンスのendIndexプロパティは、常にcountと同一です。

source: The firstName constant is an instance of the Substring type—a type that represents substrings of a string while sharing the original string’s storage.
ja: firstName定数は、Substring型 — ある文字列の下位文字列をオリジナル文字列のもつストレージを共有している間に表す型のインスタンスです。

source: The high component of the value carries the sign, if the type is signed.
ja: 値のhigh構成部分は符号を運びます、その型が符号付きならば。

source: The nameAlias property is provided to issue corrections if a name was issued erroneously.
ja: nameAliasプロパティは、ある名前が不正確に発行されたならば、訂正を発行するために提供されます。

source: The nextPartialResult closure executes sequentially with an accumulating value initialized to initialResult and each element of the sequence.
ja: nextPartialResultクロージャは、initialResultへと初期化された蓄積値とそのシーケンスの各要素を使って連続して遂行します。

source: The nextPartialResult closure is called sequentially with an accumulating value initialized to initialResult and each element of the sequence.
ja: nextPartialResultクロージャは、initialResultへと初期化された蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The nextPartialResult closure is called with initialResult—0 in this case—and the first element of numbers, returning the sum: 1.
ja: nextPartialResultクロージャが、initialResult—この場合では0—そしてnumbersの最初の要素とともに呼び出されて、その合計：1を返します。

source: The nextPartialResult closure receives initialResult the first time the closure executes.
ja: nextPartialResultクロージャは、initialResultを、そのクロージャが遂行される最初の時に受け取ります。

source: The nextPartialResult closure receives initialResult the first time the closure runs.
ja: nextPartialResultは、initialResultを、クロージャが動作する最初の時に受け取ります。

source: The numbers array is now arranged in two partitions.
ja: numbers配列は今や２つの区分に整頓されます。

source: The startIndex property of an UnsafeBufferPointer instance is always zero.
ja: UnsafeBufferPointerインスタンスのstartIndexプロパティは、常にゼロです。

source: The startIndex property of an UnsafeMutableBufferPointer instance is always zero.
ja: UnsafeMutableBufferPointerインスタンスのstartIndexプロパティは、常にゼロです。

source: The unicodeScalars view’s elements comprise each Unicode scalar value in the cafe string.
ja: unicodeScalarsビューのもつ各要素は、cafe文字列の中の各ユニコードスカラー値からなります。

source: The updateAccumulatingResult closure is called sequentially with a mutable accumulating value initialized to initialResult and each element of the sequence.
ja: updateAccumulatingResultクロージャは、initialResultへと初期化された可変の蓄積値とシーケンスの各要素とともに連続して呼び出されます。

source: The updateAccumulatingResult closure is called with the initial accumulating value—[:] in this case—and the first character of letters, modifying the accumulating value by setting 1 for the key "a".
ja: updateAccumulatingResultクロージャが、初期蓄積値—この場合では[:]—そしてlettersの最初の文字とともに呼び出されて、1をキー"a"に対して設定することで蓄積値を修正します。

source: The flatMap(_:) method “flattens” the resulting sequence-of-sequences into a single AsyncSequence.
ja: flatMap(_:)メソッドは、結果のシーケンスのシーケンスを単一のAsyncSequenceへと “平坦にします”。

source: The String type bridges with the Objective-C class NSString and offers interoperability with C functions that works with strings.
ja: String型は、Objective-CクラスNSStringとブリッジします、そしてC関数で文字列を扱うものと相互運用を提示します。

source: The Substring type presents the same interface as String, so you can avoid or defer any copying of the string’s contents.
ja: Substring型は、Stringと同じインターフェイスを提供します、それであなたは文字列の内容の何らかのコピーを避けるまたは延期できます。

source: The apple string contains a single emoji character made up of a surrogate pair when encoded in UTF-16.
ja: apple文字列は、UTF-16でエンコードされる場合あるサロゲートペアから作り上げられる単一のemoji文字を含みます。

source: The moveInitializeMemory(as:from:count:) method automatically performs a forward or backward copy of all instances from the source region to their destination.
ja: moveInitializeMemory(as:from:count:)メソッドは、すべてのインスタンスの前方および後方へのコピーをソース領域からそれらの行き先へ自動的に実行します。

source: The strncmp function takes two const char* pointers and an integer specifying the number of characters to compare.
ja: strncmp関数は、２つのconst char*ポインタと、比較する文字数を指定している整数を取ります。

source: The removeLast() method must be used only on a nonempty collection.
ja: removeLast()メソッドは、空でないコレクションでのみ使われるべきです。

source: The ..< operator creates a range that doesn’t include the upper bound, so it’s always safe to use with endIndex.
ja: ..<演算子は上方の境界を含まないある範囲を作成します、それでそれは常にendIndexと使うのに安全です。

source: The high and low properties of the result value represent 2000 when concatenated to form a double-width integer; that is, using result.high as the high byte and result.low as the low byte of a UInt16 instance.
ja: result値のhighおよびlowプロパティは、二倍幅整数に成形するために連結される時2000を表します；すなわち、UInt16インスタンスの高バイトとしてresult.highをそして低バイトとしてresult.lowを使って。

source: The nameAlias property then contains the corrected name.
ja: nameAliasプロパティはその後、訂正された名前を含みます。

source: The allSatisfy(_:) method checks to see whether all elements produced by the sequence are less than 10.
ja: allSatisfy(_:)メソッドは、シーケンスによって生み出されたすべての要素が10より小さいかどうか見るために調べます。

source: The contains(_:) method checks to see whether the sequence produces the value 5:
ja: contains(_:)メソッドは、シーケンスが値5を生み出すかどうか見るために調べます：

source: The contains(where:) method checks to see whether the sequence produces a value divisible by 3:
ja: contains(where:)メソッドは、シーケンスが3で割り切れる値を生み出すかどうか見るために調べます：

source: The drop(while:) method causes the modified sequence to ignore received values until it encounters one that is divisible by 3:
ja: drop(while:)メソッドは、修正されたシーケンスが、それが3によって割り切れるものに出くわすまで受け取った値を無視することを引き起こします：

source: The dropFirst(_:) method causes the modified sequence to ignore the values 0 through 4, and instead emit 5 through 10:
ja: dropFirst(_:)メソッドは、その修正されたシーケンスに値0から4を無視させます、そして代わりに5から10を放出させます：

source: The filter(_:) method returns true for even values and false for odd values, thereby filtering out the odd values:
ja: filter(_:)メソッドは、trueを偶数値に対してそしてfalseを奇数値に対して返します、それによって奇数値を取り除いています：

source: The first(where:) method returns the first member of the sequence that’s evenly divisible by both 2 and 3.
ja: first(where:)メソッドは、2と3の両方で整然と割り切れるこのシーケンスの最初のメンバーを返します。

source: The high and low compnents of the result value represent -1920 when concatenated to form a double-width integer; that is, using result.high as the high byte and result.low as the low byte of an Int16 instance.
ja: result値のhighとlow構成要素は、２倍幅整数に成形するために連結される場合-1920を表します；すなわち、result.highを高バイトとしてresult.lowを低バイトとしてInt16インスタンスに使って。

source: The max() method returns the max value of the sequence.
ja: max()メソッドは、シーケンスの最大値を返します。

source: The min() method returns the minimum value of the sequence.
ja: min()メソッドは、シーケンスの最小値を返します。

source: The prefix(_:) method causes the modified sequence to pass through the first six values, then end.
ja: prefix(_:)メソッドは、その修正されたシーケンスに最初の６つの値をずっと渡させて、それから終わらせます。

source: The prefix(while:) method causes the modified sequence to pass along values so long as they aren’t divisible by 2 and 3.
ja: prefix(while:)メソッドは、修正されたシーケンスが値それらを、それらが2と3によって割り切れない限り通過させるようにします。

source: The reduce(_:_:) method sums the values received from the asynchronous sequence.
ja: reduce(_:_:)メソッドは、非同期シーケンスから受け取った値それらを合計します。

source: The CFArrayCreateMutable(_:_:_:) function takes a CFArrayCallBacks structure, which is initialized with function pointer callbacks:
ja: CFArrayCreateMutable(_:_:_:)関数は、ひとつのCFArrayCallBacks構造体を取ります、それは関数ポインタコールバックで初期化されます：

source: The CoffeeDataStore actor saves the data on a background thread.
ja: CoffeeDataStoreアクターは、データをあるバックグラウンドスレッド上で保存します。

source: The base property of the slice is equal to singleDigits.
ja: このスライスのbaseプロパティは、singleDigitsに等しいです。

source: The #keyPath string expression accepts chained method or property references.
ja: #keyPath文字列式は、数珠つなぎにされたメソッドまたはプロパティ参照を受け入れます。

source: The ASCII representation of a number in the radix passed as radix.
ja: radixとして渡される基数におけるある数のASCII表現。

source: The ASCII representation of a number.
ja: ある数のASCII表現。

source: The C ‘_Bool’ and C++ ‘bool’ type.
ja: Cの「_Bool」およびC++の「bool」型。

source: The C ‘_Float16’ type.
ja: C「_Float16」型。

source: The C ‘char’ type.
ja: Cの「char」型。

source: The C ‘double’ type.
ja: C「double」型。

source: The C ‘float’ type.
ja: C「float」型。

source: The C ‘int’ type.
ja: C「int」型。

source: The C ‘long long’ type.
ja: C「long long」型。

source: The C ‘long’ type.
ja: C「long」型。

source: The C ‘short’ type.
ja: C「short」型。

source: The C ‘signed char’ type.
ja: C「signed char」型。

source: The C ‘unsigned char’ type.
ja: C「unsigned char」型。

source: The C ‘unsigned int’ type.
ja: C「unsigned int」型。

source: The C ‘unsigned long long’ type.
ja: C「unsigned long long」型。

source: The C ‘unsigned long’ type.
ja: C「unsigned long」型。

source: The C ‘unsigned short’ type.
ja: C「unsigned short」型。

source: The C++ ‘wchar_t’ type.
ja: C++「wchar_t」型。

source: The C++11 ‘char16_t’ type, which has UTF-16 encoding.
ja: C++11「char16_t」型、それはUTF-16エンコーディングされます。

source: The C++11 ‘char32_t’ type, which has UTF-32 encoding.
ja: C++11「char32_t」型、それはUTF-32エンコーディングされます。

source: The Fitzpatrick skin types are examples of emoji modifiers; they change the appearance of the preceding emoji base (that is, a scalar for which isEmojiModifierBase is true) by rendering it with a different skin tone.
ja: Fitzpatrickスキン型はemoji修飾子の例です；それらは先行するemoji基盤（すなわち、それに対してisEmojiModifierBaseがtrueであるスカラー）の外観を、それを異なるスキントーンで描出することによって変更します。

source: The Sendable protocol indicates that value of the given type can be safely used in concurrent code.
ja: Sendableプロトコルは、与えられた型の値が並行性コードにおいて安全に使用できることを指し示します。

source: The Swift standard library defines a base layer of functionality for writing Swift programs, including:
ja: Swift標準ライブラリは、Swiftプログラムを記述するための機能性の基盤層を定義していて、以下を含んでいます：

source: The Swift standard library’s text-related types, String, Character, and Unicode.Scalar, all conform to TextOutputStreamable.
ja: Swift標準ライブラリのテキスト関連の型、String、Character、そしてUnicode.Scalarは、すべてTextOutputStreamableに準拠します。

source: The UTF-16 code unit offset corresponding to this Index
ja: このインデックスに対応しているUTFー16コード単位オフセット。

source: The UTF-16 code units of a string’s utf16 view match the elements accessed through indexed NSString APIs.
ja: 文字列のもつutf16ビューのUTF-16コード単位は、NSString APIでインデックスを使われることでアクセスされる要素と一致します。

source: The Unicode code point to use for the scalar.
ja: このスカラーのために使うユニコードコード点。

source: The Unicode encoding of input.
ja: inputのユニコードエンコーディング。

source: The Unicode encoding of the data referenced by cString.
ja: cStringによって参照されるデータのユニコードエンコーディング。

source: The Unicode scalar value "\u{301}" modifies the preceding character to include an accent, so "e\u{301}" has the same canonical representation as the single Unicode scalar value "é".
ja: ユニコードスカラー値"\u{301}"は、先行する文字を修飾してアクセントを含めます、それで"e\u{301}"は単一のユニコードスカラー値"é"と同じ正準表現を持ちます。

source: The Unicode scalar value of A is 65, which is small enough to fit in a single code unit in both UTF-16 and UTF-8.
ja: Aのユニコードスカラー値は65です、それはUTF-16およびUTF-8両方において単一のコード単位の中にぴったり収まるにの十分に小さいです。

source: The Unicode scalar value to encode.
ja: エンコードするあるユニコードスカラー値。

source: The Unicode-safe comparison matches Unicode extended grapheme clusters rather than the code points used to compose them.
ja: ユニコード安全比較は、ユニコード拡張書記素クラスタにマッチします、それらを組み立てるのに使われるコード点ではなく。

source: The Unicode-safe comparison matches Unicode scalar values rather than the code points used to compose them.
ja: ユニコード安全での比較は、ユニコードスカラー値を比べます、それらを組み立てるのに使われるコード点ではなく。

source: The UnsafeSendable protocol indicates that value of the given type can be safely used in concurrent code, but disables some safety checking at the conformance site.
ja: UnsafeSendableプロトコルは、与えられた型の値が並行性コードにおいて安全に使用できる、しかしいくつかの安全検査を適応場所で作動しなくすることを指し示します

source: The accessed slice uses the same indices for the same elements as the original buffer uses.
ja: アクセスされるスライス（断片）は、同じ要素に対して、元のバッファが使うのと同じインデックスを使います。

source: The accessed slice uses the same indices for the same elements as the original collection uses.
ja: アクセスされるスライス（切り取り）は、同じ要素に対して元のコレクションが使うのと同じインデックスを使います。

source: The accessed slice uses the same indices for the same elements as the original collection.
ja: アクセスされるスライス（切り取り）は、同じ要素に対して元のコレクションと同じインデックスを使います。

source: The addition operator (+) calculates the sum of its two arguments.
ja: 加算演算子（+）は、それの２つの引数の合計を計算します。

source: The address of that buffer is passed to the callee, and on return, the value in the buffer is loaded, retained, and reassigned into the operand.
ja: そのバッファのアドレスは呼び出される側に渡されます、そして戻る時に、バッファの値はロードされ、保持され、演算数に再割り当てされます。

source: The address of the memory that starts the buffer.
ja: メモリのアドレス、それはバッファを始めます。

source: The address passed as bitPattern must have the correct alignment for the pointer’s Pointee type.
ja: bitPatternとして渡されるアドレスは、ポインタの持つPointee型に対して整合状態でなければなりません。

source: The algorithm used to create random values may change in a future version of Swift.
ja: 無作為値を作成するために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to select a random element may change in a future version of Swift.
ja: ある無作為な要素を選択するために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to shuffle a collection may change in a future version of Swift.
ja: あるコレクションをシャッフルするために使われるアルゴリズムは、将来のSwiftバージョンで変わるかもしれません。

source: The algorithm used to shuffle a sequence may change in a future version of Swift.
ja: あるシーケンスをシャッフルするために使われるアルゴリズムは、将来のSwiftバージョンで変更するかもしれません。

source: The alignment of the new region of allocated memory, in bytes.
ja: アロケートされたメモリの新しい領域のアラインメント、バイトで。

source: The allocated memory is not bound to any specific type and must be bound before performing any typed operations.
ja: アロケートされたメモリは、何ら特定の型に束縛されません、そして何らかの型付き演算を実行する前に束縛されなければなりません。

source: The amount of memory to allocate, counted in instances of Element.
ja: アロケートするメモリの総量、Elementのインスタンスで数えられます。

source: The amount of memory to allocate, counted in instances of Pointee.
ja: アロケートするメモリの総量、Pointeeのインスタンスで数えられます。

source: The amount of memory to bind to type T, counted as instances of T.
ja: 型Tへと束縛するメモリの量、Tのインスタンスとして数えられます。

source: The approximate size of all literal segments combined.
ja: 結合された全てのリテラル文節のおおよそのサイズ。

source: The array to append to.
ja: 追加先の配列。

source: The base state.
ja: 基底状態。

source: The base to use for the string representation.
ja: 文字列表現のために使う底。

source: The basic unit of encoding
ja: 符号化の基本単位。

source: The behavior of accessing memory as a type unrelated to its bound type is undefined.
ja: メモリにそれの束縛型と関係ない型でアクセスすることの挙動は未定義です

source: The big-endian representation of this integer.
ja: この整数のビッグエンディアン表現。

source: The bit width of a UInt16 instance is 16.
ja: UInt16インスタンスのビット幅は16です。

source: The bit width of a UInt32 instance is 32.
ja: UInt32インスタンスのビット幅は32です。

source: The bit width of a UInt64 instance is 64.
ja: UInt64インスタンスのビット幅は64です。

source: The bit width of a UInt instance is 32 on 32-bit platforms and 64 on 64-bit platforms.
ja: UIntインスタンスのビット幅は、32ビットプラットホーム上では32そして64ビットプラットホーム上では64です。

source: The bit width of an UInt8 instance is 8.
ja: UInt8インスタンスのビット幅は８です。

source: The bitwise NOT operator (~) is a prefix operator that returns a value in which all the bits of its argument are flipped: Bits that are 1 in the argument are 0 in the result, and bits that are 0 in the argument are 1 in the result.
ja: ビット単位のNOT演算子（~）は前置演算子で、それの引数のビットすべてがひっくり返されるある値を返します：引数において1であるビットは結果において0になります、そして引数において0であるビットは結果において1になります。

source: The bounds of the range must be valid indices of the buffer.
ja: 範囲の境界は、このバッファの有効なインデックスでなければなりません。

source: The bounds of the range must be valid indices of the collection.
ja: この範囲の境界は、コレクションの有効なインデックスでなければなりません。

source: The bounds of the range must be valid indices of the string.
ja: この範囲の境界は、文字列の有効なインデックスでなければなりません。

source: The bounds of the range must be valid indices of the view.
ja: この範囲の境界は、ビューの有効なインデックスでなければなりません。

source: The buffer argument contains the same number of complete instances of T as the original<br/>buffer’s count.
ja: バッファ引数は、オリジナルのバッファのもつcountと同じ数の完全なTのインスタンスを含まなければなりません。
